snlkuharlocal/src/Documents/ПоступлениеВЗонуХранения/ПоступлениеВЗонуХранения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеВЗонуХранения</name>
  <basedOn>Document.ЗаявкаВТранспортныйОтдел</basedOn>
  <registerRecords>AccumulationRegister.АдресноеХранениеОстатки</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиЗХ</registerRecords>
  <attributes>
    <name>ЗонаХранения</name>
    <type>
      <types>CatalogRef.ЗоныХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>НеКонтролироватьОстаткиЗХ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Паллета</name>
    <type>
      <types>DocumentRef.Паллета</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Короба</name>
    <attributes>
      <name>ШККоробки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерЛистаНабора</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>17</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерНакладной</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШКЛистаНабора</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШКПаллеты</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерКоробки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Накладная</name>
      <type>
        <types>DocumentRef</types>
      </type>
    </attributes>
    <attributes>
      <name>КоробовВНакладной</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидНакладной</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/AccumulationRegisters/ОстаткиЗХ/ОстаткиЗХ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиЗХ</name>
  <resources>
    <name>КоличествоКоробок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>НомерЛистаНабора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерНакладной</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерКоробки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Накладная</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоступления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ШКЛистаНабора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ЗонаХранения</name>
    <type>
      <types>CatalogRef.ЗоныХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ШККоробки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ШКПаллеты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/AccumulationRegisters/АдресноеХранениеОстатки/АдресноеХранениеОстатки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>АдресноеХранениеОстатки</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийОстатки</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЗонаХранения</name>
    <type>
      <types>CatalogRef.ЗоныХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/Enums/КодыОперацийОстатки/КодыОперацийОстатки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КодыОперацийОстатки</name>
  <enumValues>
    <name>ВводОстатков</name>
  </enumValues>
  <enumValues>
    <name>Закупка</name>
    <comment>Закупка</comment>
  </enumValues>
  <enumValues>
    <name>Реализация</name>
    <comment>Продажа</comment>
  </enumValues>
  <enumValues>
    <name>Рекламация</name>
    <comment>Рекламация</comment>
  </enumValues>
  <enumValues>
    <name>ВозвратОтПокупателя</name>
    <comment>Возврат от покупателя</comment>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
    <comment>Перемещение</comment>
  </enumValues>
  <enumValues>
    <name>Пересортица</name>
    <comment>Пересортица</comment>
  </enumValues>
  <enumValues>
    <name>Списание</name>
    <comment>Списание</comment>
  </enumValues>
  <enumValues>
    <name>Оприходование</name>
    <comment>Оприходование</comment>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
    <comment>Прочее</comment>
  </enumValues>
  <enumValues>
    <name>ЗакупкаР</name>
    <comment>Закупка (реальная)</comment>
  </enumValues>
  <enumValues>
    <name>Инвентаризация</name>
    <comment>Инвентаризация</comment>
  </enumValues>
  <enumValues>
    <name>Бонус</name>
  </enumValues>
  <enumValues>
    <name>Взаимозачет</name>
  </enumValues>
  <enumValues>
    <name>Комплектация</name>
  </enumValues>
  <enumValues>
    <name>ПогашениеСертификата</name>
  </enumValues>
  <enumValues>
    <name>Переоценка</name>
  </enumValues>
  <enumValues>
    <name>ВозвратПоставщику</name>
    <comment>Возврат поставщику</comment>
  </enumValues>
  <enumValues>
    <name>Комиссия</name>
  </enumValues>
  <enumValues>
    <name>АгентскийДоговор</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/ПоступлениеВЗонуХранения/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	СписокШК=Короба.ВыгрузитьКолонку("ШККоробки");	
	Запрос=новый запрос; 
	Запрос.Текст="ВЫБРАТЬ
	|	ОстаткиЗХОстатки.ШККоробки КАК ШККоробки,
	|	ОстаткиЗХОстатки.ЗонаХранения КАК ЗонаХранения,
	//Кухарь 19.03.17 начало
	//Для подсчёта количества паллет	
	|	ОстаткиЗХОстатки.ШКПаллеты
	//Кухарь 19.03.17 конец
	|ИЗ
	|	РегистрНакопления.ОстаткиЗХ.Остатки(&Дата, ШККоробки В (&Шк)) КАК ОстаткиЗХОстатки
	|ГДЕ
	|	ОстаткиЗХОстатки.КоличествоКоробокОстаток > 0";				 
	Запрос.УстановитьПараметр("ШК",СписокШК);	
	Запрос.УстановитьПараметр("Дата",Дата);
	ЕстьНаОстатках=запрос.Выполнить().Выгрузить();
	
	Для каждого ТекСтрока из ЕстьНаОстатках цикл
		Движение = Движения.ОстаткиЗХ.Добавить();
		ЗаполнитьЗначенияСвойств(движение,ТекСтрока);
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.ЗонаХранения = ТекСтрока.ЗонаХранения;
		Движение.КоличествоКоробок = 1;	
	КонецЦикла;
	
	
	
	
	Для Каждого ТекСтрокаКороба Из Короба Цикл
		Движение = Движения.ОстаткиЗХ.Добавить();
		ЗаполнитьЗначенияСвойств(движение,ТекСтрокаКороба);	
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.ЗонаХранения = ЗонаХранения;
		Движение.КоличествоКоробок = 1;
		//Кухарь 30.03.16 начало
		//Будем фиксировать   накладную
		Движение.Накладная=ТекСтрокаКороба.Накладная;
		Движение.ДатаПоступления=Дата;
		//Кухарь 30.03.16 конец
	КонецЦикла;

	
	//Кухарь 26.09.17 начало
	//Проводки по остаткам адресного хранения номенклатуры
	для каждого СтрТЧ из Товары цикл
		если СтрТЧ.Количество=0 тогда Продолжить;КонецЕсли;
		
		Движение = Движения.АдресноеХранениеОстатки.Добавить();
		ЗаполнитьЗначенияСвойств(движение,СтрТЧ);	
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		//Движение.Паллета=Паллета;
		Движение.ЗонаХранения = ЗонаХранения;
		Движение.КодОперации=Перечисления.КодыОперацийОстатки.Перемещение;
		
	КонецЦикла;
	//Кухарь 26.09.17 конец	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
КонецПроцедуры
